pet_examples/model_comp_corr/gpt3/mermaid/activities/10_13.mmd
graph LR
INQ[INQ Transmits Request] --> IP[IP Checks Request]
IP --> AQ[IP Answers Question]
AQ --> TD[Transmission of Data]
AQ --> R[Rejection]
